#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:023179631616:secret:address-validation/dev/api-key]
data.aws_iam_policy_document.lambda_assume_role: Reading...
aws_secretsmanager_secret.google_maps_api_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:023179631616:secret:address-validation/dev/google-maps-api-key]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/address-validation-dev]
aws_cloudwatch_log_group.authorizer: Refreshing state... [id=/aws/lambda/address-validation-authorizer-dev]
aws_apigatewayv2_api.this: Refreshing state... [id=py1sucuxvi]
aws_cloudwatch_log_group.handler: Refreshing state... [id=/aws/lambda/address-validation-handler-dev]
data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
aws_iam_role.lambda_exec: Refreshing state... [id=address-validation-lambda-dev]
data.aws_iam_policy_document.secrets_read: Reading...
data.aws_iam_policy_document.secrets_read: Read complete after 0s [id=3213121637]
data.aws_iam_policy_document.authorizer_secrets: Reading...
data.aws_iam_policy_document.authorizer_secrets: Read complete after 0s [id=2856189735]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
data.aws_iam_policy_document.lambda_logs: Reading...
data.aws_iam_policy_document.lambda_logs: Read complete after 0s [id=2885480513]
aws_iam_role_policy.authorizer_secrets: Refreshing state... [id=address-validation-lambda-dev:authorizer-secrets-read]
aws_iam_role_policy.lambda_logs: Refreshing state... [id=address-validation-lambda-dev:cloudwatch-logs]
aws_iam_role_policy.secrets_read: Refreshing state... [id=address-validation-lambda-dev:secrets-read]
aws_lambda_function.handler: Refreshing state... [id=address-validation-handler-dev]
aws_lambda_function.authorizer: Refreshing state... [id=address-validation-authorizer-dev]
aws_lambda_permission.api_gateway_handler: Refreshing state... [id=AllowAPIGatewayInvokeHandler]
aws_apigatewayv2_integration.handler: Refreshing state... [id=s8f1dfh]
aws_apigatewayv2_authorizer.api_key: Refreshing state... [id=64l2kl]
aws_lambda_permission.authorizer_invoke: Refreshing state... [id=AllowAPIGatewayInvokeAuthorizer]
aws_apigatewayv2_route.validate: Refreshing state... [id=n68uzib]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.authorizer_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "authorizer_errors" {
      + actions_enabled                       = true
      + alarm_description                     = "Authorizer Lambda error count > 3 in 5 minutes"
      + alarm_name                            = "address-validation-authorizer-errors-dev"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "address-validation-authorizer-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.handler_duration will be created
  + resource "aws_cloudwatch_metric_alarm" "handler_duration" {
      + actions_enabled                       = true
      + alarm_description                     = "Handler Lambda p99 duration > 5 seconds"
      + alarm_name                            = "address-validation-handler-duration-dev"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "address-validation-handler-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + extended_statistic                    = "p99"
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + tags_all                              = (known after apply)
      + threshold                             = 5000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.handler_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "handler_errors" {
      + actions_enabled                       = true
      + alarm_description                     = "Handler Lambda error count > 3 in 5 minutes"
      + alarm_name                            = "address-validation-handler-errors-dev"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "address-validation-handler-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.handler_throttles will be created
  + resource "aws_cloudwatch_metric_alarm" "handler_throttles" {
      + actions_enabled                       = true
      + alarm_description                     = "Handler Lambda is being throttled"
      + alarm_name                            = "address-validation-handler-throttles-dev"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "address-validation-handler-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
        id                             = "address-validation-authorizer-dev"
      ~ last_modified                  = "2026-03-22T03:40:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "m/hDT2Om4hAyvFxQzXg63O9ie6SlGC2Fr3MKgcDhdBk=" -> "x6lPYHR+BxfmPHAUmnJDpHD5zKHPikeBK5Qy7D0DrAA="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.handler will be updated in-place
  ~ resource "aws_lambda_function" "handler" {
        id                             = "address-validation-handler-dev"
      ~ last_modified                  = "2026-03-22T03:40:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "m/hDT2Om4hAyvFxQzXg63O9ie6SlGC2Fr3MKgcDhdBk=" -> "x6lPYHR+BxfmPHAUmnJDpHD5zKHPikeBK5Qy7D0DrAA="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Triggered by @mcrundo in commit 142c28f5a08f5d9189b8fedd114970fb82e3e252*